app/controllers/sessions_controller.rb

  def new
    @user = User.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.find_by(username: params[:user][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Bernie"], ["LIMIT", 1]]

  def omniauth
    if auth_hash = request.env["omniauth.auth"]
      user = User.find_or_create_by_oa(auth_hash)
---
INSERT INTO "users" ("password_digest", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?)