app/controllers/theories_controller.rb

INSERT INTO "theories" ("name", "description", "issues", "success", "prove_date", "created_at", "updated_at", "treasure_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    treasure
    @theory = @treasure.theories.build(theory_params)
    @theory.user_id = current_user.id
    if @theory.save

UPDATE "theories" SET "description" = ?, "updated_at" = ? WHERE "theories"."id" = ?  [["description", "Currents drew the bow half of the ship South while the stern went East"], ["updated_at", "2019-01-25 02:42:31.720556"], ["id", 35]]
---
  def update
    treasure
    theory.update(theory_params)

DELETE FROM "theories" WHERE "theories"."id" = ?  [["id", 23]]
---
  def destroy
    treasure
    theory.destroy

SELECT  "theories".* FROM "theories" WHERE "theories"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
  def theory
    @theory = Theory.find_by(id: params[:id])

SELECT  "treasures".* FROM "treasures" WHERE "treasures"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def treasure
    @treasure = Treasure.find_by(id: params[:treasure_id])