app/controllers/treasures_controller.rb

  def index
    @treasures = Treasure.all
---
SELECT "treasures".* FROM "treasures"

  def show
    set_theory
    @theories = Theory.all
---
SELECT "theories".* FROM "theories" WHERE "theories"."treasure_id" = ?  [["treasure_id", 12]]

  def create
    @treasure = Treasure.create(treasure_params)
---
INSERT INTO "treasures" ("created_at", "updated_at", "name", "description", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2019-01-25 01:43:16.399271"], ["updated_at", "2019-01-25 01:43:16.399271"], ["name", "Gold"], ["description", ""], ["user_id", 1]]

  def update
    if treasure.update(treasure_params)
---
UPDATE "treasures" SET "description" = ?, "updated_at" = ? WHERE "treasures"."id" = ?  [["description", "British crown jewels lost in 1217"], ["updated_at", "2019-01-22 02:57:08.010967"], ["id", 1]]

  def destroy
    @treasure.destroy
---
DELETE FROM "treasures" WHERE "treasures"."id" = ?  [["id", 1]]

  def set_treasure
    @treasure = Treasure.find_by(id: params[:id])
---
SELECT  "treasures".* FROM "treasures" WHERE "treasures"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def set_theory
    @theory = Theory.find_by(id: params[:id])
---
SELECT  "theories".* FROM "theories" WHERE "theories"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]