app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "admin", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if user.update(user_params)
---
UPDATE "users" SET "username" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "FRibble"], ["admin", 1], ["updated_at", "2019-01-19 04:04:31.799870"], ["id", 2]]

  def user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]