app/models/user.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "Fabienne.Rauber@gmail.com"], ["LIMIT", 1]]
---
	def self.find_or_create_by_oa(auth_hash)
		where(:email => auth_hash["info"]["email"]).first_or_create do |u|