app/views/treasures/show.html.erb

SELECT "theories".* FROM "theories" WHERE "theories"."treasure_id" = ? AND "theories"."success" = ?  [["treasure_id", 2], ["success", 1]]
---
      </tr>
      <% @treasure.theories.success.each do %>

SELECT "theories".* FROM "theories" WHERE "theories"."treasure_id" = ?  [["treasure_id", 2]]
---
      <% end %>
      <% @treasure.theories.each do |t| %>